# a = int(input('Введите число a: '))
# b = int(input('Введите число b: '))
# c = int(input('Введите число c: '))
#
# x1 = a/b*c+b
# x2 = (((a/b)*c)+b)
#
# print(f'Сравните результат {x1}={x2}')



# a = int(input('Введите число a: '))
# b = int(input('Введите число b: '))
# c = int(input('Введите число c: '))
#
# x1 = a+b/a*c
# x2 = (a+((b/a)*c))
#
# print(f'Сравните результат {x1}={x2}')



# x1 = 19%4+15/2*3
# x2 = ((19%4)+((15/2)*3))
#
# print(f'Сравните результат {x1}={x2}')



# x1 = (15+6)-10*4
# x2 = ((15+6)-(10*4))
#
# print(f'Сравните результат {x1}={x2}')


x1 = 17/2%2*3**3
x2 = (((17/2)%2)*(3**3))

print(f'Сравните результат {x1}={x2}' )



